{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": -6196846255254643939
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": 1604146857307713287
  },
  "m_Name": "",
  "m_Material": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Color": {
    "r": 1.0,
    "g": 1.0,
    "b": 1.0,
    "a": 1.0
  },
  "m_RaycastTarget": 1,
  "m_OnCullStateChanged": {
    "m_PersistentCalls": {
      "m_Calls": []
    }
  },
  "m_FontData": {
    "m_Font": {
      "m_FileID": 1,
      "m_PathID": 10102
    },
    "m_FontSize": 24,
    "m_FontStyle": 0,
    "m_BestFit": 0,
    "m_MinSize": 2,
    "m_MaxSize": 65,
    "m_Alignment": 0,
    "m_AlignByGeometry": 0,
    "m_RichText": 0,
    "m_HorizontalOverflow": 0,
    "m_VerticalOverflow": 0,
    "m_LineSpacing": 1.0
  },
  "m_Text": "凉屋游戏账号及云存档须知\r\n【凉屋游戏账号】\r\n1.凉屋游戏云存档使用的是凉屋游戏账号，与《大家饿餐厅》账号互通。\r\n2.凉屋游戏账号用于支持云存档功能。与KTplay无关，请勿使用KTplay账号进行登录。\r\n\r\n【什么是凉屋游戏云存档】\r\n1.《元气骑士》依旧为单机游戏，凉屋游戏云存档能为特定渠道的《元气骑士》玩家提供存档上传功能，且只适用于数据备份和特定情况下的换机需求。\r\n2.凉屋游戏云存档功能基于“凉屋游戏账号”。需要注册账号，才能够使用云存档功能。\r\n3.云存档的上传和下载均为手动操作。若没有手动上传，服务器就没有存档数据。\r\n4.游戏内的本地数据仍然保存在本地，删除游戏将无法恢复。数据备份需到云存档功能手动上传。\r\n\r\n【如何使用云存档】\r\n1.在主界面，点击右下角的“凉”字按钮，即可进入《元气骑士》云存档功能。\r\n2.首次打开该界面，会出现《云存档用户须知》。阅读并点击“同意”之后即会进入云存档界面。\r\n3.注册界面请输入真实有效的邮箱并设置密码，点击“注册”后，会提示玩家验证邮箱，根据提示前往注册的本人所属邮箱点击“验证邮件”进行验证，验证成功后返回游戏，输入账号密码即可登录。\r\n4.登录之后即可点击“上传进度”。提示“存档上传成功”并看到云端进度和本地一致即为上传成功。\r\n5.如果需要从云端下载存档，点击“下载进度”即可从云端下载游戏存档到本地。下载成功后，云端和本地存档会保持一致，此时，“上传进度”和“下载进度”会消失。\r\n\r\n【警告】云存档一旦上传或下载成功，原有存档将被覆盖，此过程不可逆，请谨慎操作。所有手动上传或者下载操作，责任均由玩家自己负责。如有更多疑问，请点击右下角“！”按钮阅读详情。\r\n\r\n【云存档保存的内容】\r\n1）宝石数量；\r\n2）解锁的角色和皮肤及角色升级情况；\r\n3）宠物皮肤；\r\n4）客厅家具及升级情况；\r\n5）花园和工坊的种子、材料和蓝图；\r\n6）地窖的武器、怪物、通关证书、成就；\r\n7）复活卡、小鱼干；\r\n8）角色技能；\r\n注意：在云存档上线前游戏卸载或者数据被清除，无法通过云存档找回。\r\n\r\n【凉屋游戏账号】\r\n1. 凉屋游戏账号只可使用真实有效的邮箱注册使用。\r\n2. 密码找回等功能均需要通过邮箱进行验证。\r\n3. 请在注册账号时，确保注册邮箱有效，以保障账号功能可以正常使用。\r\n4.凉屋游戏账号可用在凉屋游戏已上线的《元气骑士》和《大家饿餐厅》两款游戏中。如果已经在《大家饿餐厅》中注册了账号，在更新《元气骑士》2.1.5版本之后，直接输入账号邮箱和密码，点击“登录”即可。\r\n5. 在云存档界面，点击右下方人形按钮即可查看账号信息。\r\n\r\n【云存档使用限制】\r\n【账号限制】\r\n一个账号90天内只能绑定5次设备。每次绑定设备之间须间隔24小时以上。\r\n5次绑定机会用光后，不能额外增加。下一个90天周期内，绑定次数会恢复至5次。\r\nQ：哪些情况会消耗绑定次数？\r\n1. 登录一台新设备，并且上传或下载存档。此时账号绑定次数消耗1次\r\n2.手机恢复出厂设置后，登录账号，绑定次数消耗1次\r\n3.每登录1次模拟器，绑定次数消耗1次\r\n4.同一个设备登录不同的云存档邮箱账号，更换一次，绑定次数消耗1次\r\nQ：90天周期如何计算\r\n1.对已经处于等待期的玩家而言：等待期结束后，进入下一个90天周期，获得5次绑定机会。（大白话：已经等了一段时间的人不需要重新排队）\r\n2.对于当前还未达到绑定次数上限的玩家来说：从首次上传云存档开始，90天为一个周期，每个周期内至多绑定5次设备。\r\nQ: 遇到“更换设备绑定已达上限”的提示时应该怎么办？\r\n1.这说明在当前周期内，该账号已经没有可用的绑定次数了，请耐心等待下一个周期到来。\r\n2.已绑定的设备不会受到影响，只是无法绑定新设备。\r\n【绑定对应关系】\r\n一台设备同时段只能与1个账号进行绑定，但是1个账号可绑定多台设备。\r\n7天内，单个设备只能更换1次绑定账号。\r\nQ:遇到“该设备已绑定其他账号且解绑失败，请在X天后重试”提示时该怎么办？\r\nA: 请等待时间自然过渡，无其他解决方法。\r\n【存档上传限制】\r\n账号与设备绑定之后，从该账号云端下载的存档不能上传给其他账号。\r\nQ：遇到“存档不属于此账号“时该怎么办？\r\n1.云存档的绑定由“账号”与“渠道”共同构成。\r\n2.如果出现了这个问题，请检查：\r\na.【账号】请检查是否更换了账号，本地存档如果已经上传给了一个账号的云端，则不能上传给其他账号。\r\nb.【渠道】请检查是否在不同渠道下载更新了游戏，如果在一个渠道上传了存档，则不能更换渠道继续上传。\n\r\n【修改密码】\r\n1.如果忘记登录密码，可通过邮箱修改密码。但是保证邮箱是验证过的邮箱才可以修改密码。\r\n2.在登录界面，点击“忘记密码”，然后根据界面提示输入新的密码并点击“重置”。你的邮箱将收到一封确认邮件，点击邮件内的链接，即可完成修改。"
}