{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 7641613140030495736
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": 1604146857307713287
  },
  "m_Name": "",
  "m_Material": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Color": {
    "r": 1.0,
    "g": 1.0,
    "b": 1.0,
    "a": 1.0
  },
  "m_RaycastTarget": 1,
  "m_OnCullStateChanged": {
    "m_PersistentCalls": {
      "m_Calls": []
    }
  },
  "m_FontData": {
    "m_Font": {
      "m_FileID": 1,
      "m_PathID": 10102
    },
    "m_FontSize": 24,
    "m_FontStyle": 0,
    "m_BestFit": 0,
    "m_MinSize": 2,
    "m_MaxSize": 65,
    "m_Alignment": 0,
    "m_AlignByGeometry": 0,
    "m_RichText": 1,
    "m_HorizontalOverflow": 0,
    "m_VerticalOverflow": 0,
    "m_LineSpacing": 1.2
  },
  "m_Text": "概要\r\n欢迎您选择由深圳市凉屋游戏科技有限公司（以下简称“我们”或“凉屋游戏”）提供的游戏！除《凉屋游戏用户使用许可服务协议》外，我们还将通过《凉屋游戏隐私政策》向您进一步细化说明您在使用本游戏时我们收集、使用、存储和共享个人信息的情况，以及您所享有的相关权利等事宜，本政策是《用户协议》的组成部分。\r\n\r\n在使用我们的服务前，您可以通过阅读完整版《凉屋游戏隐私政策》，了解个人信息类型与用途的对应关系等更加详尽的个人信息处理规则，请您务必仔细阅读并透彻理解本政策，特别是以加粗标识的条款，您应重点阅读并在确认充分理解及同意后再开始使用。如果您继续使用我们的服务，即表示您同意我们按照本政策收集、使用、储存和披露您的相关信息。\r\n\r\n一、我们如何收集和使用个人信息\r\n二、我们如何使用COOKIES或同类技术\r\n三、我们可能分享、转让或披露的个人信息\r\n四、我们如何储存和保护个人信息\r\n五、如何管理您的个人信息\r\n六、第三方服务\r\n七、年龄限制\r\n八、通知和修订\r\n九、如何联系我们\r\n\r\n一、 我们如何收集和使用个人信息\r\n在您使用凉屋游戏的服务过程中，凉屋游戏会按照如下方式收集您在使用服务时主动提供的或因为使用服务而产生的信息，用以向您提供、优化我们的服务以及保障您的账户安全：\r\n1.1当您使用凉屋游戏的服务时，我们会收集您的网络身份标识信息及个人常用设备信息，用于标记您为凉屋游戏的用户。\r\n1.2为满足相关法律法规政策及相关主管部门的要求，凉屋游戏用户需进行实名认证以继续使用和享受凉屋游戏的服务。<b><i>我们会在获得您同意或您主动提供的情况下收集您的实名身份信息，该信息属于敏感信息，拒绝提供实名身份信息可能会导致您无法使用凉屋游戏的服务或在使用凉屋游戏的服务过程中受到相应限制。</i></b>\r\n1.3<b><i>为保障您正常使用我们的服务，维护游戏基础功能的正常运行，优化游戏产品性能，提升您的游戏体验并保障您的账号安全，我们会收集您的设备ID、设备名称、设备类型和版本、系统版本、IP地址和端口号、MAC地址、应用ID、网络类型等信息。</i></b>\r\n1.4当您使用凉屋游戏的服务时，<b><i>我们会收集您的游戏日志信息，如登录日志、物品日志、昵称和签名日志、游戏内行为信息等， </i></b>以便您能够在客户端查看您的游戏历史记录，同时用于游戏运营统计分析、客服投诉处理及其他游戏安全分析，并为提升您的游戏体验，我们可能把前述信息同步至该游戏后续版本或您正在使用的我们提供的其他产品中。\r\n1.5当您使用凉屋游戏产品的消费功能时，我们会收集您的<b><i>充值记录、消费记录</i></b>等信息，以便您查询您的交易记录，同时尽最大程度保护您的虚拟物品安全。<b><i>充值记录、消费记录</i></b>属于敏感信息，收集上述信息为实现凉屋游戏产品的消费功能所必须，否则将无法完成交易。\r\n1.6为保障您的游戏账号安全，营造公平、健康及安全的游戏环境，<b><i>我们会收集您的游戏识别信息、硬件及操作系统信息、进程及游戏崩溃记录等信息，</i></b>以用于打击破坏游戏公平环境或干扰、破坏游戏服务正常进行的行为（如用于检测盗版、扫描外挂、防止作弊等）。\r\n1.7根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用您的相关个人信息无需征求您的授权同意：\r\n1）与国家安全、国防安全等国家利益直接相关的；与公共安全、公共卫生、公共知情等重大公共利益直接相关的；\r\n2）与犯罪侦查、起诉、审判和判决执行等直接相关的；\r\n3）出于维护您或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的；\r\n4）所收集的个人信息是您自行向社会公众公开的；\r\n5）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；\r\n6）根据您要求签订和履行合同所必需的；\r\n7）用于维护所提供的产品或服务的安全稳定运行所必需的，如发现、处置产品或服务的故障；\r\n8）为开展合法的新闻报道所必需的；\r\n9）出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；\r\n10）法律法规规定的其他情形。\r\n1.8请您理解，我们向您提供的功能和服务是不断更新和发展的，如果某一功能或服务未在前述说明中且收集了您的信息，我们会通过页面提示、交互流程、网站公告等方式另行向您说明信息收集的内容、范围和目的，以征得您的同意。\r\n二、<b><i>我们如何使用COOKIES或同类技术</i></b>\r\n我们或我们的第三方合作伙伴可能通过COOKIES或同类技术获取和使用您的信息，并将该等信息储存为日志信息。\r\n通过使用COOKIES，我们向用户提供简单易行并富个性化的网络体验。一个COOKIES是少量的数据，它们从一个网络服务器送至您的浏览器并存在计算机硬盘上。我们使用COOKIES是为了让其用户可以受益。比如，为使得凉屋游戏的登录过程更快捷，您可以选择把用户名存在一个COOKIES中。这样下次当您要登录凉屋游戏的服务时能更加方便快捷。COOKIES能帮助我们确定您连接的页面和内容，您在凉屋游戏特定服务上花费的时间和您所选择的凉屋游戏服务。\r\nCOOKIES使得我们能更好、更快地为您服务，并且使您在凉屋游戏服务上的经历更富个性化。然而，您应该能够控制COOKIES是否以及怎样被您的浏览器接受。请查阅您的浏览器附带的文件以获得更多这方面的信息。\r\n我们和第三方合作伙伴可能通过COOKIES或同类技术收集和使用您的信息，并将该等信息储存。\r\n我们使用自己的COOKIES或同类技术，可能用于以下用途：\r\n（1）记住您的身份。如：COOKIES或同类技术有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供有关您的喜好或其他信息；\r\n（2）分析您使用我们服务的情况。我们可利用COOKIES或同类技术来了解您使用凉屋游戏服务进行什么活动、或哪些服务最受欢迎；\r\n（3）广告优化。COOKIES或同类技术有助于我们根据您的信息，向您提供与您相关的广告而非进行普遍的广告投放。 我们为上述目的使用COOKIES或同类技术的同时，可能将通过COOKIES或同类技术收集的非个人身份信息汇总提供给广告商和其他伙伴，用于分析您和其他用户如何使用凉屋游戏服务并用于广告服务。\r\n凉屋游戏服务上可能会有广告商和其他合作方放置的COOKIES或同类技术。这些COOKIES和或同类技术可能会收集与您相关的非个人身份信息，以用于分析用户如何使用该等服务、向您发送您可能感兴趣的广告，或用于评估广告服务的效果。这些第三方COOKIES或同类技术收集和使用该等信息不受本政策约束，而是受到其自身的信息保护声明约束，我们不对第三方的COOKIES或同类技术承担责任。\r\n<b><i>您可以通过浏览器或用户选择机制拒绝或管理COOKIES或同类技术。但请您注意，如果您停用COOKIES或同类技术，我们有可能无法为您提供最佳的服务体验，某些服务也可能无法正常使用。同时，您仍然将收到广告，只是这些广告与您的相关性会降低。</i></b>\r\n\r\n三、<b><i>我们可能分享、转让或披露的个人信息</i></b>\r\n（一）<b><i>分享</i></b>\r\n除以下情形外，未经您同意，我们不会与凉屋游戏之外的任何第三方分享您的个人信息：\r\n1、向您提供我们的服务。我们可能向合作伙伴及其他第三方分享您的信息，以实现我们产品与/或服务的功能，让您正常使用您需要的服务，如：提供支付服务的支付机构、提供数据服务（包括网络广告监测、数据统计、数据分析）的合作伙伴、第三方物流公司和其他服务提供商；\r\n2、与关联方的必要分享。为便于我们基于统一的账号体系向您提供一致化服务以及便于您进行统一管理、个性化推荐、保障系统和账号安全等，您的个人信息可能会在我们和我们的关联方之间进行必要共享；\r\n3、实现本政策第一条“我们如何收集和使用个人信息”部分所述目的；\r\n4、履行我们在本政策或我们与您达成的其他协议中的义务和行使我们的权利；\r\n5、向委托我们进行推广的合作伙伴等第三方共享，目的是为了使该等委托方了解推广的覆盖面和有效性。比如我们可以告知该委托方有多少人看了他们的推广信息或在看到这些信息后购买了委托方的商品，或者向他们提供不能识别个人身份的统计信息，帮助他们了解其受众或顾客；\r\n6、在法律法规允许的范围内，为了遵守法律、维护我们及我们的关联方或合作伙伴、您或其他凉屋游戏用户或社会公众利益、财产或安全免遭损害，比如为防止欺诈等违法活动和减少信用风险，我们可能与其他公司和组织交换信息。不过，这并不包括违反本政策中所作的承诺而为获利目的出售、出租、共享或以其它方式披露的信息；\r\n7、应您合法需求或经您的授权同意；\r\n8、应您的监护人合法要求而提供您的信息；\r\n9、根据与您签署的单项服务协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；\r\n10、基于学术研究而提供；\r\n11、基于符合法律法规的社会公共利益而提供。\r\n<b><i>我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息。对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本政策以及其他任何相关的保密和安全措施来处理信息。</i></b>\r\n（二）<b><i>转让</i></b>\r\n1、随着我们业务的持续发展，我们有可能进行合并、收购、资产转让或类似的交易，而您的信息有可能作为此类交易的一部分而被转移。我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则，我们将要求该公司、组织重新向您征求授权同意。 2、在获得您的明确同意后，我们会向其他方转让您的个人信息。\r\n（三）<b><i>披露</i></b>\r\n我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会披露您的个人信息：\r\n1、根据您的需求，在您明确同意的披露方式下披露您所指定的信息；\r\n2、根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您信息的情况下，我们可能会依据所要求的信息类型和披露方式披露您的信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求接收方必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。\r\n（四）分享、转让、披露信息时事先征得授权同意的例外\r\n以下情形中，分享、转让、披露您的信息无需事先征得您的授权同意：\r\n1、与国家安全、国防安全有关的；\r\n2、与公共安全、公共卫生、重大公共利益有关的；\r\n3、与犯罪侦查、起诉、审判和判决执行等司法或行政执法有关的；\r\n4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；\r\n5、您自行向社会公众公开的信息；\r\n6、从合法公开披露的信息中收集信息的，如合法的新闻报道、政府信息公开等渠道。\r\n<b><i>根据法律规定，共享、转让、披露经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。</i></b>\r\n\r\n四、<b><i>我们如何储存和保护个人信息</i></b>\r\n我们仅在本政策所述目的所必需期间和法律法规要求的最短时限内储存您的个人信息。如我们终止服务或运营，我们将及时停止继续收集您个人信息的活动，同时会遵守相关法律法规要求提前向您通知，并在终止服务或运营后对您的个人信息进行删除或匿名化处理，但法律法规或监管部门另有规定的除外。\r\n我们在中华人民共和国境内运营中收集和产生的个人信息，储存在中国境内，以下情形除外：\r\n1、法律法规有明确规定；\r\n2、获得您的授权同意；\r\n3、您使用的产品、服务涉及跨境，凉屋游戏需要向境外提供您的个人信息的。\r\n针对以上情形，我们会确保依据本政策及国家法律法规要求对您的个人信息提供足够的保护。\r\n我们非常重视信息安全，成立了专门的安全团队，并采取一切合理可行的措施，保护您的个人信息：\r\n（一）数据安全技术措施\r\n我们会采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问使用、修改，避免数据的损坏或丢失。\r\n我们的服务采取了多种加密技术，如在某些产品中，我们将利用加密技术（如SSL）来保护您的个人信息，采取加密技术对您的个人信息进行加密保存，并通过隔离技术进行隔离。\r\n在个人信息使用时，如信息展示、信息关联计算，我们会采用多种数据脱敏技术增强信息在使用中的安全性。\r\n我们还会采用严格的数据访问权限控制和多重身份认证技术保护个人信息，避免数据被违规使用。\r\n（二）我们为保护个人信息采取的其他安全措施\r\n我们通过建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用。\r\n我们通过信息接触者保密协议、监控和审计机制来对数据进行全面安全控制。我们还会举办安全和隐私保护培训课程，加强员工的安全意识以及对于保护信息重要性的认识。\r\n（三）我们仅允许有必要知晓这些信息的凉屋游戏员工、合作伙伴访问您的个人信息，并为此设置了严格的访问权限控制和监控机制。我们同时要求可能接触到您的个人信息的所有人员履行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任或被中止与凉屋游戏的合作关系。\r\n（四）我们会采取一切合理可行的措施，确保未收集无关的个人信息。\r\n（五）互联网并非绝对安全的环境，而且电子邮件、即时通讯、社交软件或其他服务软件等与其他用户的交流方式无法确定是否完全加密，我们建议您使用此类工具时请使用复杂密码，并注意保护您的信息安全。\r\n（六）安全事件处置\r\n在通过凉屋游戏服务与第三方进行沟通或购买商品及服务时，您不可避免的要向交易对方或潜在的交易对方披露自己的信息，如联络方式或者邮政地址等。请您妥善保护自己的信息，仅在必要的情形下向他人提供。 为应对个人信息泄露、损毁和丢失等可能出现的风险，我们制定了多项制度，明确安全事件、安全漏洞的分类分级标准及相应的处理流程。我们也为安全事件建立了专门的应急响应团队，按照安全事件处置规范要求，针对不同安全事件启动安全预案，进行止损、分析、定位、制定补救措施、联合相关部门进行溯源和打击。\r\n在不幸发生信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们同时将及时将事件相关情况以邮件、信函、电话、或推送通知等方式告知您，难以逐一告知信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报信息安全事件的处置情况。\r\n请您理解，由于技术的限制以及风险防范的局限，即便我们已经尽量加强安全措施，也无法始终保证信息百分之百的安全。您需要了解，您接入凉屋游戏服务所用的系统和通讯网络，有可能因我们可控范围外的情况而发生问题。\r\n\r\n五、<b><i>如何管理您的个人信息</i></b>\r\n（一）<b><i>访问、更新和删除</i></b>\r\n我们鼓励您更新和修改您的个人信息以使其更准确有效。您能通过凉屋游戏服务访问您的个人信息，并根据对应信息的管理方式自行完成或要求我们进行修改、补充和删除。我们将采取适当的技术手段或提供提交申请的联系渠道，尽可能保证您可以访问、更新和更正自己的个人信息或使用凉屋游戏服务时提供的其他信息。\r\n在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障信息安全。对于通过COOKIES或同类技术收集的您的信息，我们还在本政策第二条“我们如何使用COOKIES或同类技术”部分说明了向您提供的选择机制。如您想查询、修改或删除您的部分信息，请联系凉屋游戏客服具体指引进行操作。\r\n除法律法规另有规定，当您更正、删除您的个人信息或申请注销账号时，我们可能不会立即从备份系统中更正或删除相应的信息，但会在备份更新时更正或删除这些信息。\r\n（二）<b><i>公开与分享</i></b>\r\n我们的多项服务可让您不仅与您的社交网络、也与使用该服务的所有用户公开分享您的相关信息，如，您在凉屋游戏服务中所上传或发布的信息、您对其他人上传或发布的信息作出的回应，通过电子邮件或在凉屋游戏服务中不特定用户可见的公开区域内上传或公布您的信息，以及包括与这些信息有关的位置数据和日志信息。只要您不删除您所公开或共享的信息，有关信息可能一直留存在公众领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公众领域保存。如您将信息通过上述渠道公开或共享，由此造成您的信息泄露，我们不承担责任。因此，我们提醒并请您慎重考虑是否通过上述渠道公开或共享您的信息。\r\n（三）<b><i>注销</i></b>\r\n在符合凉屋游戏单项服务的服务协议约定条件及国家相关法律法规规定的情况下，您的该项凉屋游戏服务账号可能被注销或删除。当账号注销或被删除后，与该账号相关的、该单项服务项下的全部服务资料和数据将依照单项服务的服务协议约定删除或处理，但法律法规另有规定的除外。\r\n（四）<b><i>改变您授权同意的范围</i></b>\r\n您总是可以选择是否披露信息。有些信息是使用凉屋游戏服务所必需的，但大多数其他信息的提供是由您决定的。您可以随时、不受限制地通过删除信息、在终端设备修改开放权限、关闭相关设备功能等方式改变您授权我们继续收集信息的范围或撤回您的授权，该变更操作即时生效，凉屋游戏将根据您开放的权限提供相应的服务。\r\n当您撤回授权后，我们无法继续为您提供撤回授权所对应的服务，也不再处理您相应的信息。但您撤回授权的决定，不会影响此前基于您的授权而开展的信息处理。\r\n\r\n六、<b><i>第三方服务</i></b>\r\n凉屋游戏服务可能链接至第三方提供的社交媒体或其他服务（包括网站或其他服务形式）。包括：\r\n（1）您可利用“分享”键将某些内容分享到第三方服务，或您可利用第三方服务登录凉屋游戏服务。这些功能可能会收集您的信息（包括您的日志信息），并可能在您的电脑装置COOKIES，从而正常运行上述功能；\r\n（2）我们通过广告或我们服务的其他方式向您提供链接，使您可以链接至第三方的服务或网站；\r\n（3）其他接入第三方服务的情形。如，为实现本政策中声明的目的，我们可能会接入第三方SDK服务，并将我们依照本政策收集的您的某些个人信息共享给该等第三方，以便提供更好的客户服务和用户体验。\r\n该等第三方社交媒体或其他服务由相关的第三方负责运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何信息），须受第三方自己的服务条款及信息保护声明（而非本政策）约束，您需要仔细阅读其条款。本政策仅适用于我们所收集的个人信息，并不适用于任何第三方提供的服务或第三方的信息使用规则。如您发现这些第三方社交媒体或其他服务存在风险时，建议您终止相关操作以保护您的合法权益。\r\n\r\n七、<b><i>年龄限制</i></b>我们建议：<b><i>任何未成年人参加网上活动应事先取得父母或其他监护人（以下简称\"监护人\"）的同意。我们将根据国家相关法律法规的规定保护未成年人的相关信息。</i></b>\r\n\r\n我们鼓励监护人指导未成年人使用凉屋游戏服务。如果您是未满十四周岁的未成年人，您需要通知您的监护人共同阅读并接受我们的《凉屋游戏儿童隐私保护指引》 ，并在您使用凉屋游戏服务、提交个人信息之前，寻求其同意和指导。\r\n\r\n<b><i>我们只会在获得（推定获得）法定监护人同意的前提下，收集、使用未成年人的个人信息，且根据相关法律法规和监管政策的规定，使用和处理获得的未成年人个人信息。如发现在未事先获得法定监护人同意的情况下，我们可能收集了未成年人的个人信息，我们会对该等数据和个人信息尽快进行删除等操作处理。</i></b>\r\n\r\n若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，请及时与我们的客服联系。\r\n\r\n八、<b><i>通知和修订</i></b>\r\n为了给您提供更好的服务，我们可能会根据产品或服务的更新情况及法律法规的相关要求适时修改本政策的条款，该等修改构成本政策的一部分。如该等更新造成您在本政策下权利的实质减少或重大变更，我们将在本政策生效前通过网站公告、推送通知、弹窗提示或其他方式来通知您，您如果不同意该等变更，可以选择停止使用凉屋游戏服务；如您仍然继续使用凉屋游戏服务的，即表示您已充分阅读、理解并同意受经修订的本政策的约束。\r\n\r\n我们的任何修改都会将您的满意度置于首位。我们鼓励您在每次使用凉屋游戏服务时都查阅我们的隐私政策。\r\n\r\n我们可能在必需时（如当我们由于系统维护而暂停某一项服务时）发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。\r\n\r\n九、<b><i>如何联系我们</i></b>\r\n如果您对本协议或游戏的游戏服务有意见或建议，可与凉屋游戏客户服务部门联系，我们会给予您必要的帮助。联系方式如下：\r\n\r\n游戏客服：QQ（公众号）800179233\r\n\r\n联系邮箱：info@chillyroom.com\r\n\r\n深圳市凉屋游戏科技有限公司\r\n\r\n注： 凉屋账号并非强制用户使用，凉屋账号仅用于为用户提供云存档服务，只适用于数据备份和特定情况下的换机需求。《元气骑士》本身为单机游戏，游戏内的本地数据仍然保存在本地，删除游戏将无法恢复。\r\n对于iOS用户，如需进行数据备份或者有换机需求，需要使用由iCloud提供基础服务的云存档功能。玩家需要通过iOS设备登录并开启iCloud服务，并登陆GameCenter后在游戏内手动上传。具体信息参见：http://www.chillyroom.com/cloudsavedetail-ios/ 。\r\n对于安卓用户，若需要将数据备份到云端，玩家需要通过凉屋账号手动上传。具体信息参见：http://www.chillyroom.com/cloudsavedetail/ 。\r\n"
}