{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 4785070855354270712
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": 1604146857307713287
  },
  "m_Name": "",
  "m_Material": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Color": {
    "r": 1.0,
    "g": 1.0,
    "b": 1.0,
    "a": 1.0
  },
  "m_RaycastTarget": 1,
  "m_OnCullStateChanged": {
    "m_PersistentCalls": {
      "m_Calls": []
    }
  },
  "m_FontData": {
    "m_Font": {
      "m_FileID": 1,
      "m_PathID": 10102
    },
    "m_FontSize": 24,
    "m_FontStyle": 0,
    "m_BestFit": 0,
    "m_MinSize": 2,
    "m_MaxSize": 65,
    "m_Alignment": 0,
    "m_AlignByGeometry": 0,
    "m_RichText": 1,
    "m_HorizontalOverflow": 0,
    "m_VerticalOverflow": 0,
    "m_LineSpacing": 1.2
  },
  "m_Text": "欢迎您选择由深圳市凉屋游戏科技有限公司（以下简称“我们”或“凉屋游戏”）提供的游戏！除《凉屋游戏隐私政策》、《凉屋游戏用户使用许可服务协议》外，我们还将通过《凉屋游戏儿童隐私保护指引》（“本政策”）帮助您和孩子（本政策中的“孩子”，是指不满十四周岁的未成年人）进一步了解我们收集、使用、存储和共享您孩子个人信息的情况，以及您和您的孩子所享有的相关权利。\r\n\r\n儿童特别说明：本政策内的儿童指不满十四周岁的未成年人用户。如果您是儿童，请通知并确保您的监护人务必认真阅读并充分理解本儿童隐私政策，并在您使用凉屋游戏的服务、提交个人信息之前，寻求、获得您的监护人的同意和指导。您点击同意本儿童隐私政策，或者您使用/继续使用凉屋游戏的服务、提交个人信息，我们将善意地理解前述行为表示您已获得您的监护人的许可，您的监护人同意按照本儿童隐私政策（包括更新版本）同意/授权我们收集、存储、使用、转移和披露儿童的个人信息。\r\n\r\n监护人特别说明：如您的孩子不满十四周岁将适用本儿童隐私政策，您作为儿童的法定监护人应认真阅读并理解我们的儿童隐私保护政策。我们将根据本儿童隐私政策采取特殊措施保护您孩子的个人信息。请您帮助我们，履行保护儿童个人信息和隐私安全的责任，要求他们在您的监护下共同阅读并接受本隐私政策，且应在您的同意和指导下使用凉屋游戏的服务、提交个人信息。如果您不同意本隐私政策的内容，将可能导致凉屋游戏的产品和服务无法正常运行，或者无法达到凉屋游戏拟达到的服务效果，且您应要求您的孩子立即停止访问/使用凉屋游戏的服务。您点击同意本隐私政策，或者您的孩子使用/继续使用凉屋游戏的服务、提交个人信息，我们都理解并确信该等行为表示您同意凉屋游戏按照本隐私政策（包括更新版本）收集、存储、使用、转移和披露您孩子的个人信息。\r\n\r\n【重要提示】： 本政策适用于不满十四周岁的未成年人的个人信息处理。有关您和已满十四周岁的用户的个人信息处理，请查看《凉屋游戏隐私政策》了解相关信息。 我们会通过页面提示、交互流程、网站公告等方式向您说明儿童个人信息收集等情况，并征得您的同意。请您仔细阅读、充分理解《凉屋游戏隐私政策》和本政策后，选择是否同意前述隐私政策，特别是以加粗标识的条款。\r\n1. <b><i>我们收集的儿童个人信息</i></b>\r\n在您的孩子使用凉屋游戏的服务的过程中，凉屋游戏仅会收集您同意我们收集的或您及您的孩子主动提供的有关您孩子的个人信息，以向您的孩子提供、优化我们的服务以及保障您孩子的账户安全。同时凉屋游戏将为您提供拒绝选项，如您未同意我们收集信息的请求，视为您同意凉屋游戏将无法继续为您以及您的孩子提供相应的服务。\r\n我们可能会收集的您孩子的个人信息的详情，请参见《凉屋游戏隐私政策》。\r\n同时，为验证您与您孩子的监护关系，我们可能还会收集您的联系方式<b><i>（包括手机号码、电子邮箱）</i></b>以及其他有助于我们判断监护关系的信息。\r\n目前，除了向第三方调研机构收集游戏调研信息，以帮助我们改进游戏产品以及提供个性化服务之外，我们不会主动从凉屋游戏外的第三方获取您孩子的个人信息。如未来为业务发展需要从凉屋游戏外的第三方间接获取您孩子的个人信息，我们会在获取前向您明示个人信息的来源、类型及使用范围，如凉屋游戏开展业务需进行的个人信息处理活动超出您原本向凉屋游戏外的第三方提供个人信息时的授权同意范围，我们将在处理您孩子的该等个人信息前，征得您的明示同意；此外，我们也将会严格遵守相关法律法规的规定，并要求该第三方保障其提供的信息的合法性。\r\n2. <b><i>我们如何使用儿童个人信息</i></b>\r\n我们严格遵守法律法规的规定以及与用户的约定，按照本政策及《凉屋游戏用户使用许可服务协议》、《凉屋游戏隐私政策》所述使用收集的信息，以向您的孩子提供更为优质的服务。\r\n有关我们使用儿童个人信息的方式详情请参见《凉屋游戏隐私政策》，若我们使用您孩子的个人信息，超出了与收集时所声称的目的及具有直接或合理关联的范围，我们将在使用您孩子的个人信息前，再次向您告知并征得您的同意。\r\n3. <b><i>儿童个人信息的存储</i></b>\r\n3.1我们按照法律法规规定，将在中华人民共和国境内收集到的您孩子的个人信息存储于中华人民共和国境内，并依法对这些信息进行严格保密。<b><i>如涉及跨境业务，我们需要向境外机构传输境内收集的相关个人信息的，我们也会根据国内法律、行政法规和相关监管部门的规定，为您孩子的个人信息提供保护。</i></b>\r\n3.2一般情况下，我们只会在为实现服务目的所必需的时间内或法律法规规定的条件下存储您孩子的个人信息。超出法律法规或监管规定的期限后，我们会按照法律法规的要求对您孩子的个人信息进行删除或者匿名化处理。\r\n4. <b><i>儿童个人信息的安全</i></b>\r\n4.1为了保障您孩子的信息安全，我们会在现有技术水平下采取合理必要的措施来保护孩子的信息，采取物理防护、安全技术、管理制度等措施来降低丢失、误用、非授权访问、披露和更改的风险，包括但不限于数据加密传输、防火墙和加密存储、物理访问控制以及信息访问授权控制。为此我们设置了安全程序保护您孩子的信息不会被未经授权的访问所窃取，所有的个人信息被加密储存并放置于经防火墙严格保护的内部系统。\r\n4.2为了保障您孩子的信息安全，我们建立了专门的管理制度、流程和组织以保障信息的安全。例如，我们严格限制访问信息的人员范围，要求他们遵守保密义务，并进行审计。\r\n4.3若发生儿童个人信息泄露等安全事件，我们会启动应急预案，阻止安全事件扩大，并及时以弹窗公告或邮件等形式告知您和孩子安全事件的基本情况、我们即将或已经采取的处置措施和补救措施，以及我们对您的应对建议。如果难以实现逐一告知，我们将通过公告等方式发布警示。\r\n5. <b><i>儿童个人信息的更正</i></b>\r\n如您和孩子发现儿童个人信息有错误的，可以联系我们处理。\r\n6. <b><i>儿童个人信息的删除</i></b>\r\n6.1如您和孩子发现我们违反法律、行政法规的规定或者双方的约定处理儿童个人信息的，或是超出目的范围或者必要期限处理儿童个人信息的，可以通过联系我们对相关个人信息进行删除。\r\n6.2如您撤回同意，可以联系我们，我们将按照国家有关法律规定进行处理。\r\n6.3如我们的产品或者服务停止运营，我们将根据相关法律法规规定进行通知，同时也将及时停止使用儿童个人信息，并将对保存的儿童个人信息进行删除或匿名化处理。\r\n7. <b><i>儿童个人信息的转移和委托处理</i></b>\r\n我们不会向第三方转移和委托第三方处理儿童个人信息，除以下情况外，未经监护人的另外授权同意，我们不会向第三方转移、委托第三方处理或者与第三方分享儿童个人信息：\r\n7.1为实现本政策第2条“我们如何使用儿童个人信息”中所述目的，或者为履行本政策或我们与儿童、监护人达成的其他协议中约定的我们的义务以及行使我们的权利；\r\n7.2在遵循法律法规要求的前提下，为了符合法律规定、维护儿童、监护人、凉屋游戏、凉屋游戏的关联方、凉屋游戏的合作伙伴或其他凉屋游戏用户的合法权益或社会公众利益的需要（比如为防止违法活动），我们可能与其他组织交换信息。 对于上述确需第三方转移或委托第三方处理的，我们都会根据法律、行政法规的规定进行合规措施，包括但不限于对第三方进行安全评估。\r\n8. <b><i>儿童个人信息的披露</i></b>\r\n除非法律、行政法规规定应当披露或者根据与您的约定可以披露您孩子的个人信息的，我们不会披露孩子的个人信息。\r\n9. <b><i>变更</i></b>\r\n我们可能会适时对本政策进行修订。当本政策的条款发生变更时，我们会在版本更新时以适当的方式向您提示变更后的指引。请您仔细阅读变更后的隐私保护指引或指引内容，您的孩子继续使用凉屋游戏的服务表示您同意我们按照更新后的隐私保护指引收集、处理或使用您孩子的个人信息。\r\n10. <b><i>其他</i></b>\r\n《凉屋游戏隐私政策》是凉屋游戏统一适用的一般性隐私条款，其中所规定的内容包括但不限于用户权利及信息安全保障措施等均适用于凉屋游戏用户。本政策是专门针对儿童的隐私保护指引，包含对于儿童个人信息的特殊保护，属于《凉屋游戏隐私政策》的补充内容。如《凉屋游戏隐私政策》与本政策存在不一致或矛盾之处，请以本政策为准。\r\n11. <b><i>联系我们</i></b>\r\n如果您对本协议或游戏的游戏服务有意见或建议，可与凉屋游戏客户服务部门联系，我们会给予您必要的帮助。联系方式如下：\r\n\r\n游戏客服：QQ（公众号）800179233\r\n\r\n联系邮箱：info@chillyroom.com\r\n\r\n深圳市凉屋游戏科技有限公司\r\n"
}